cases/squareCylinder/system/decomposeParDict.m4
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains VARNPROC;

method             scotch;
